[
    {
        "name": "Streptococcosis",
        "cause": "Bacterium Streptococcus iniae. Commonly transmitted through water or direct contact with infected fish.",
        "cure": "Administer antibiotics such as oxytetracycline or florfenicol. Improve water quality and reduce stress."
    },
    {
        "name": "Parasitic Diseases",
        "cause": "Various parasitic organisms like protozoans, trematodes, and cestodes infecting fish, often through contaminated water.",
        "cure": "Use antiparasitic medications such as formalin or copper sulfate. Maintain proper water quality and hygiene."
    },
    {
        "name": "Columnaris Disease",
        "cause": "Bacterium Flavobacterium columnare. This bacterium thrives in warm water, particularly under stressful conditions.",
        "cure": "Treat with antibiotics like oxytetracycline or potassium permanganate. Maintain optimal water conditions."
    },
    {
        "name": "Tilapia Lake Virus",
        "cause": "Virus (Tilapia Lake Virus). Primarily transmitted through contaminated water or infected fish.",
        "cure": "No known cure. Prevention includes improving water quality, avoiding overcrowding, and using virus-free fish stocks."
    },
    {
        "name": "Motile Aeromonad Septicemia",
        "cause": "Bacterium Aeromonas hydrophila. Can be transmitted through water and often occurs under poor water conditions.",
        "cure": "Administer antibiotics such as oxytetracycline. Improve water quality and avoid stress in fish."
    },
    {
        "name": "Normal Nile Tilapia",
        "cause": "No disease present. This refers to healthy Nile tilapia with no signs of infection or illness.",
        "cure": "Maintain good cultural practices, proper water quality, and regular health monitoring."
    },
    {
        "name": "Aeromonas Infection",
        "cause": "Bacterium Aeromonas species. Commonly found in warm waters, can infect through open wounds or poor water quality.",
        "cure": "Administer antibiotics like oxytetracycline. Improve water quality and ensure proper fish handling."
    },
    {
        "name": "Sehat",
        "cause": "No disease present. 'Sehat' indicates the fish are healthy.",
        "cure": "Maintain good management practices and ensure proper water and feeding conditions for optimal health."
    },
    {
        "name": "White Spot (WS)",
        "cause": "Parasite Ichthyophthirius multifiliis. A protozoan that infects fish, leading to white cysts on the skin and fins.",
        "cure": "Treat with formalin, copper sulfate, or malachite green. Maintain proper water temperature and quality."
    }
  ]
  